{
  "updates": [
    {
      "id": "1",
      "name": "Finally got updates working!",
      "content": "I finally got the updates working! I'm so happy! This is my own personal website, so I can do whatever I want with it. I'm going to be adding a lot more content to it, so stay tuned!",
      "date": "2023-03-24 16:10"
    },
    {
      "id": "2",
      "name": "Ways to improve experinence",
      "content": "Yes! This is the page I am wanting to improve. For now, it looks rather bland. I'm going to be adding a lot more content to it, so stay tuned!",
      "date": "2023-03-24 16:15"
    },
    {
      "id": "3",
      "name": "Deployed the updates page",
      "content": "I was initially nervous if the updates page would even work, because I did a lot of weird stuff with the swr library and hosted the .json file on github to avoid paying for database hosting",
      "date": "2023-03-24 17:24"
    },
    {
      "id": "4",
      "name": "Also made a updater script",
      "content": "Edit: I rewrote this because I added markdown support for myself and wanted to test if it is actually working. Editing the content everytime was a pain in the json file, so I added a little python magic and made a simple script that you can find [here](https://github.com/newtoallofthis123/About_next/blob/main/updates.py). Quite happy with the result actually.",
      "date": "2023-03-24 17:46"
    },
    {
      "id": "5",
      "name": "Markdown in updates",
      "content": "Yes! I finally have markdown in the updates. I use a library called [marked.js](https://marked.js.org). It parsed markdown.\nand converts it into HTML. So, now, with the power of markdown I can use links and also embed images all in a json file..\nSo at this point, is it really a json file or a full on database?",
      "date": "2023-03-24 22:21"
    }
  ],
  "links": [
    {
      "id": "1",
      "name": "daily.dev gets 11million seed funding",
      "content": "Yes! daily.dev, the open source developer news aggregator got 11 million in funding! daily.dev is going to be able to grow even more! congrats to them!",
      "url": "https://daily.dev/blog/seed-round",
      "date": "2023-03-24 16:10"
    },
    {
      "id": "2",
      "name": "My new updates page is live!",
      "content": "Yes! I finally got the updates page working! I'm so happy! This is my own personal website, so I can do whatever I want with it. I'm going to be adding a lot more content to it, so stay tuned!",
      "url": "https://new.noobscience.rocks/updates",
      "date": "2023-03-24 16:15"
    }
  ],
  "go": [
    {
      "slug": "github",
      "url": "https://github.com/newtoallofthis123"
    },
    {
      "slug": "twitter",
      "url": "https://twitter.com/noobscience1"
    },
    {
      "url": "https://youtube.com",
      "slug": "yt"
    }
  ]
}